KemGong/cola_os/bsp/SWM181xx/Libraries/SWM181_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM181.h
#define SYS_SLEEP_SLEEP_Pos			0		//将该位置1后，系统将进入SLEEP模式
#define SYS_SLEEP_SLEEP_Msk			(0x01 << SYS_SLEEP_SLEEP_Pos)
#define SYS_SLEEP_STOP_Pos			1		//将该位置1后，系统将进入STOP 模式
#define SYS_SLEEP_STOP_Msk			(0x01 << SYS_SLEEP_STOP_Pos)

#define SYS_TWKCR_EN_Pos			0
#define SYS_TWKCR_EN_Msk			(0x01 << SYS_TWKCR_EN_Pos)
#define SYS_TWKCR_ST_Pos			1		//写1清零
#define SYS_TWKCR_ST_Msk			(0x01 << SYS_TWKCR_ST_Pos)

#define SYS_RSTSR_POR_Pos			0
#define SYS_RSTSR_POR_Msk			(0x01 << SYS_RSTSR_POR_Pos)
#define SYS_RSTSR_WDT_Pos			3
#define SYS_RSTSR_WDT_Msk			(0x01 << SYS_RSTSR_WDT_Pos)

#define SYS_CACHECR_BYPASS_Pos		0
#define SYS_CACHECR_BYPASS_Msk		(0x01 << SYS_CACHECR_BYPASS_Pos)

#define SYS_HRCCR_EN_Pos			0		//High speed RC Enable
#define SYS_HRCCR_EN_Msk			(0x01 << SYS_HRCCR_EN_Pos)
#define SYS_HRCCR_DBL_Pos		    1		//Double Frequency	0 24MHz	1 48MHz
#define SYS_HRCCR_DBL_Msk		    (0x01 << SYS_HRCCR_DBL_Pos)

#define SYS_BODCR_ST_Pos			1		//BOD状态，只读
#define SYS_BODCR_ST_Msk			(0x01 << SYS_BODCR_ST_Pos)
#define SYS_BODCR_IE_Pos			3		//BOD中断使能
#define SYS_BODCR_IE_Msk			(0x01 << SYS_BODCR_IE_Pos)
#define SYS_BODCR_IF_Pos			8		//BOD中断状态，写1清零
#define SYS_BODCR_IF_Msk			(0x01 << SYS_BODCR_IF_Pos)

#define SYS_CMPCR_VREF_Pos		    0		//参考电压 = 0.3v + VREF * 0.15v
#define SYS_CMPCR_VREF_Msk		    (0x0F << SYS_CMPCR_VREF_Pos)
#define SYS_CMPCR_CMP0EN_Pos		4		//模拟比较器0使能
#define SYS_CMPCR_CMP0EN_Msk		(0x01 << SYS_CMPCR_CMP0EN_Pos)
#define SYS_CMPCR_CMP1EN_Pos		5
#define SYS_CMPCR_CMP1EN_Msk		(0x01 << SYS_CMPCR_CMP1EN_Pos)
#define SYS_CMPCR_CMP2EN_Pos		6
#define SYS_CMPCR_CMP2EN_Msk		(0x01 << SYS_CMPCR_CMP2EN_Pos)
#define SYS_CMPCR_CMP0HYS_Pos	    7		//模拟比较器0迟滞使能
#define SYS_CMPCR_CMP0HYS_Msk	    (0x01 << SYS_CMPCR_CMP0HYS_Pos)
#define SYS_CMPCR_CMP1HYS_Pos	    8
#define SYS_CMPCR_CMP1HYS_Msk	    (0x01 << SYS_CMPCR_CMP1HYS_Pos)
#define SYS_CMPCR_CMP2HYS_Pos	    9
#define SYS_CMPCR_CMP2HYS_Msk	    (0x01 << SYS_CMPCR_CMP2HYS_Pos)
#define SYS_CMPCR_CMP0INP_Pos	    10		//模拟比较器0正输入端选择： 0 参考电压VREF	1 外部引脚输入
#define SYS_CMPCR_CMP0INP_Msk	    (0x01 << SYS_CMPCR_CMP0INP_Pos)
#define SYS_CMPCR_CMP1INP_Pos	    11
#define SYS_CMPCR_CMP1INP_Msk	    (0x01 << SYS_CMPCR_CMP1INP_Pos)
#define SYS_CMPCR_CMP2INP_Pos	    12
#define SYS_CMPCR_CMP2INP_Msk	    (0x01 << SYS_CMPCR_CMP2INP_Pos)

#define SYS_CMPSR_CMP0OUT_Pos	    0		//模拟比较器0输出： 1 P端>N端	0 N端>P端
#define SYS_CMPSR_CMP0OUT_Msk	    (0x01 << SYS_CMPSR_CMP0OUT_Pos)
#define SYS_CMPSR_CMP1OUT_Pos	    1
#define SYS_CMPSR_CMP1OUT_Msk	    (0x01 << SYS_CMPSR_CMP1OUT_Pos)
#define SYS_CMPSR_CMP2OUT_Pos	    2
#define SYS_CMPSR_CMP2OUT_Msk	    (0x01 << SYS_CMPSR_CMP2OUT_Pos)
#define SYS_CMPSR_CMP0IE_Pos		4		//模拟比较器0输出有变化中断使能
#define SYS_CMPSR_CMP0IE_Msk		(0x01 << SYS_CMPSR_CMP0IE_Pos)
#define SYS_CMPSR_CMP1IE_Pos		5
#define SYS_CMPSR_CMP1IE_Msk		(0x01 << SYS_CMPSR_CMP1IE_Pos)
#define SYS_CMPSR_CMP2IE_Pos		6
#define SYS_CMPSR_CMP2IE_Msk		(0x01 << SYS_CMPSR_CMP2IE_Pos)
#define SYS_CMPSR_CMP0IF_Pos		8		//模拟比较器0输出有变化
#define SYS_CMPSR_CMP0IF_Msk		(0x01 << SYS_CMPSR_CMP0IF_Pos)
#define SYS_CMPSR_CMP1IF_Pos		9
#define SYS_CMPSR_CMP1IF_Msk		(0x01 << SYS_CMPSR_CMP1IF_Pos)
#define SYS_CMPSR_CMP2IF_Pos		10
#define SYS_CMPSR_CMP2IF_Msk		(0x01 << SYS_CMPSR_CMP2IF_Pos)

#define SYS_XTALCR_EN_Pos		    1
#define SYS_XTALCR_EN_Msk		    (0x01 << SYS_XTALCR_EN_Pos)

#define SYS_LRCCR_EN_Pos			0		//Low Speed RC Enable
#define SYS_LRCCR_EN_Msk			(0x01 << SYS_LRCCR_EN_Pos)




typedef struct {
	__IO uint32_t IRQ0_SRC;					//选择哪个外设的中断请求连接到内核的IRQ0中断请求线
	__IO uint32_t IRQ1_SRC;
	__IO uint32_t IRQ2_SRC;
	__IO uint32_t IRQ3_SRC;
	__IO uint32_t IRQ4_SRC;
	__IO uint32_t IRQ5_SRC;
	__IO uint32_t IRQ6_SRC;
	__IO uint32_t IRQ7_SRC;
	__IO uint32_t IRQ8_SRC;
	__IO uint32_t IRQ9_SRC;
	__IO uint32_t IRQ10_SRC;
	__IO uint32_t IRQ11_SRC;
	__IO uint32_t IRQ12_SRC;
	__IO uint32_t IRQ13_SRC;
	__IO uint32_t IRQ14_SRC;
	__IO uint32_t IRQ15_SRC;
	
		 uint32_t RESERVED[64];
	
	__IO uint32_t IRQ16_IF;				  	//IRQ16--IRQ31每一个IRQ上可以连接两个外设中断，此寄存器用于判断两个外设中断中的哪一个触发了中断请求
	__IO uint32_t IRQ17_IF;
	__IO uint32_t IRQ18_IF;
	__IO uint32_t IRQ19_IF;
	__IO uint32_t IRQ20_IF;
	__IO uint32_t IRQ21_IF;
	__IO uint32_t IRQ22_IF;
	__IO uint32_t IRQ23_IF;
	__IO uint32_t IRQ24_IF;
	__IO uint32_t IRQ25_IF;
	__IO uint32_t IRQ26_IF;
	__IO uint32_t IRQ27_IF;
	__IO uint32_t IRQ28_IF;
	__IO uint32_t IRQ29_IF;
	__IO uint32_t IRQ30_IF;
	__IO uint32_t IRQ31_IF;
	
		 uint32_t RESERVED2[48];
	
	__IO uint32_t IRQ16_SRC;				//IRQ16--IRQ31每一个IRQ上可以连接两个外设中断，此寄存器的[4:0]选择连接到IRQ16上的INT0，
											//													     [9:5]选择连接到IRQ16上的INT1
	__IO uint32_t IRQ17_SRC;
	__IO uint32_t IRQ18_SRC;
	__IO uint32_t IRQ19_SRC;
	__IO uint32_t IRQ20_SRC;
	__IO uint32_t IRQ21_SRC;
	__IO uint32_t IRQ22_SRC;
	__IO uint32_t IRQ23_SRC;
	__IO uint32_t IRQ24_SRC;
	__IO uint32_t IRQ25_SRC;
	__IO uint32_t IRQ26_SRC;
	__IO uint32_t IRQ27_SRC;
	__IO uint32_t IRQ28_SRC;
	__IO uint32_t IRQ29_SRC;
	__IO uint32_t IRQ30_SRC;
	__IO uint32_t IRQ31_SRC;
	
		 uint32_t RESERVED3[32];
	
	__IO uint32_t GPIOA_IF;				 	//当把引脚中断连接到IRQ16--IRQ31时，整个端口使用一个中断请求号，
											//查询此寄存器可知道是GPIOA端口中的哪个引脚请求的中断
	__IO uint32_t GPIOB_IF;
	__IO uint32_t GPIOC_IF;
	__IO uint32_t GPIOD_IF;
	__IO uint32_t GPIOE_IF;
} IRQMUX_TypeDef;


#define IRQMUX_IRQ16_IF_INT0_Pos	0
#define IRQMUX_IRQ16_IF_INT0_Msk	(0x01 << IRQMUX_IRQ16_IF_INT0_Pos)
#define IRQMUX_IRQ16_IF_INT1_Pos	1
#define IRQMUX_IRQ16_IF_INT1_Msk	(0x01 << IRQMUX_IRQ16_IF_INT1_Pos)

#define IRQMUX_IRQ17_IF_INT0_Pos	0
#define IRQMUX_IRQ17_IF_INT0_Msk	(0x01 << IRQMUX_IRQ17_IF_INT0_Pos)
#define IRQMUX_IRQ17_IF_INT1_Pos	1
#define IRQMUX_IRQ17_IF_INT1_Msk	(0x01 << IRQMUX_IRQ17_IF_INT1_Pos)

#define IRQMUX_IRQ18_IF_INT0_Pos	0
#define IRQMUX_IRQ18_IF_INT0_Msk	(0x01 << IRQMUX_IRQ18_IF_INT0_Pos)
#define IRQMUX_IRQ18_IF_INT1_Pos	1
#define IRQMUX_IRQ18_IF_INT1_Msk	(0x01 << IRQMUX_IRQ18_IF_INT1_Pos)

#define IRQMUX_IRQ19_IF_INT0_Pos	0
#define IRQMUX_IRQ19_IF_INT0_Msk	(0x01 << IRQMUX_IRQ19_IF_INT0_Pos)
#define IRQMUX_IRQ19_IF_INT1_Pos	1
#define IRQMUX_IRQ19_IF_INT1_Msk	(0x01 << IRQMUX_IRQ19_IF_INT1_Pos)

#define IRQMUX_IRQ20_IF_INT0_Pos	0
#define IRQMUX_IRQ20_IF_INT0_Msk	(0x01 << IRQMUX_IRQ20_IF_INT0_Pos)
#define IRQMUX_IRQ20_IF_INT1_Pos	1
#define IRQMUX_IRQ20_IF_INT1_Msk	(0x01 << IRQMUX_IRQ20_IF_INT1_Pos)

#define IRQMUX_IRQ21_IF_INT0_Pos	0
#define IRQMUX_IRQ21_IF_INT0_Msk	(0x01 << IRQMUX_IRQ21_IF_INT0_Pos)
#define IRQMUX_IRQ21_IF_INT1_Pos	1
#define IRQMUX_IRQ21_IF_INT1_Msk	(0x01 << IRQMUX_IRQ21_IF_INT1_Pos)

#define IRQMUX_IRQ22_IF_INT0_Pos	0
#define IRQMUX_IRQ22_IF_INT0_Msk	(0x01 << IRQMUX_IRQ22_IF_INT0_Pos)
#define IRQMUX_IRQ22_IF_INT1_Pos	1
#define IRQMUX_IRQ22_IF_INT1_Msk	(0x01 << IRQMUX_IRQ22_IF_INT1_Pos)

#define IRQMUX_IRQ23_IF_INT0_Pos	0
#define IRQMUX_IRQ23_IF_INT0_Msk	(0x01 << IRQMUX_IRQ23_IF_INT0_Pos)
#define IRQMUX_IRQ23_IF_INT1_Pos	1
#define IRQMUX_IRQ23_IF_INT1_Msk	(0x01 << IRQMUX_IRQ23_IF_INT1_Pos)

