KemGong/cola_os/bsp/SWM181xx/Libraries/SWM181_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM181.h
#define IRQMUX_GPIOB_IF_PIN0_Pos	0
#define IRQMUX_GPIOB_IF_PIN0_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN0_Pos)
#define IRQMUX_GPIOB_IF_PIN1_Pos	1
#define IRQMUX_GPIOB_IF_PIN1_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN1_Pos)
#define IRQMUX_GPIOB_IF_PIN2_Pos	2
#define IRQMUX_GPIOB_IF_PIN2_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN2_Pos)
#define IRQMUX_GPIOB_IF_PIN3_Pos	3
#define IRQMUX_GPIOB_IF_PIN3_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN3_Pos)
#define IRQMUX_GPIOB_IF_PIN4_Pos	4
#define IRQMUX_GPIOB_IF_PIN4_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN4_Pos)
#define IRQMUX_GPIOB_IF_PIN5_Pos	5
#define IRQMUX_GPIOB_IF_PIN5_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN5_Pos)
#define IRQMUX_GPIOB_IF_PIN6_Pos	6
#define IRQMUX_GPIOB_IF_PIN6_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN6_Pos)
#define IRQMUX_GPIOB_IF_PIN7_Pos	7
#define IRQMUX_GPIOB_IF_PIN7_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN7_Pos)
#define IRQMUX_GPIOB_IF_PIN8_Pos	8
#define IRQMUX_GPIOB_IF_PIN8_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN8_Pos)
#define IRQMUX_GPIOB_IF_PIN9_Pos	9
#define IRQMUX_GPIOB_IF_PIN9_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN9_Pos)
#define IRQMUX_GPIOB_IF_PIN10_Pos	10
#define IRQMUX_GPIOB_IF_PIN10_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN10_Pos)
#define IRQMUX_GPIOB_IF_PIN11_Pos	11
#define IRQMUX_GPIOB_IF_PIN11_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN11_Pos)
#define IRQMUX_GPIOB_IF_PIN12_Pos	12
#define IRQMUX_GPIOB_IF_PIN12_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN12_Pos)
#define IRQMUX_GPIOB_IF_PIN13_Pos	13
#define IRQMUX_GPIOB_IF_PIN13_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN13_Pos)
#define IRQMUX_GPIOB_IF_PIN14_Pos	14
#define IRQMUX_GPIOB_IF_PIN14_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN14_Pos)
#define IRQMUX_GPIOB_IF_PIN15_Pos	15
#define IRQMUX_GPIOB_IF_PIN15_Msk	(0x01 << IRQMUX_GPIOB_IF_PIN15_Pos)

#define IRQMUX_GPIOC_IF_PIN0_Pos	0
#define IRQMUX_GPIOC_IF_PIN0_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN0_Pos)
#define IRQMUX_GPIOC_IF_PIN1_Pos	1
#define IRQMUX_GPIOC_IF_PIN1_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN1_Pos)
#define IRQMUX_GPIOC_IF_PIN2_Pos	2
#define IRQMUX_GPIOC_IF_PIN2_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN2_Pos)
#define IRQMUX_GPIOC_IF_PIN3_Pos	3
#define IRQMUX_GPIOC_IF_PIN3_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN3_Pos)
#define IRQMUX_GPIOC_IF_PIN4_Pos	4
#define IRQMUX_GPIOC_IF_PIN4_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN4_Pos)
#define IRQMUX_GPIOC_IF_PIN5_Pos	5
#define IRQMUX_GPIOC_IF_PIN5_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN5_Pos)
#define IRQMUX_GPIOC_IF_PIN6_Pos	6
#define IRQMUX_GPIOC_IF_PIN6_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN6_Pos)
#define IRQMUX_GPIOC_IF_PIN7_Pos	7
#define IRQMUX_GPIOC_IF_PIN7_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN7_Pos)
#define IRQMUX_GPIOC_IF_PIN8_Pos	8
#define IRQMUX_GPIOC_IF_PIN8_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN8_Pos)
#define IRQMUX_GPIOC_IF_PIN9_Pos	9
#define IRQMUX_GPIOC_IF_PIN9_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN9_Pos)
#define IRQMUX_GPIOC_IF_PIN10_Pos	10
#define IRQMUX_GPIOC_IF_PIN10_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN10_Pos)
#define IRQMUX_GPIOC_IF_PIN11_Pos	11
#define IRQMUX_GPIOC_IF_PIN11_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN11_Pos)
#define IRQMUX_GPIOC_IF_PIN12_Pos	12
#define IRQMUX_GPIOC_IF_PIN12_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN12_Pos)
#define IRQMUX_GPIOC_IF_PIN13_Pos	13
#define IRQMUX_GPIOC_IF_PIN13_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN13_Pos)
#define IRQMUX_GPIOC_IF_PIN14_Pos	14
#define IRQMUX_GPIOC_IF_PIN14_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN14_Pos)
#define IRQMUX_GPIOC_IF_PIN15_Pos	15
#define IRQMUX_GPIOC_IF_PIN15_Msk	(0x01 << IRQMUX_GPIOC_IF_PIN15_Pos)

#define IRQMUX_GPIOD_IF_PIN0_Pos	0
#define IRQMUX_GPIOD_IF_PIN0_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN0_Pos)
#define IRQMUX_GPIOD_IF_PIN1_Pos	1
#define IRQMUX_GPIOD_IF_PIN1_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN1_Pos)
#define IRQMUX_GPIOD_IF_PIN2_Pos	2
#define IRQMUX_GPIOD_IF_PIN2_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN2_Pos)
#define IRQMUX_GPIOD_IF_PIN3_Pos	3
#define IRQMUX_GPIOD_IF_PIN3_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN3_Pos)
#define IRQMUX_GPIOD_IF_PIN4_Pos	4
#define IRQMUX_GPIOD_IF_PIN4_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN4_Pos)
#define IRQMUX_GPIOD_IF_PIN5_Pos	5
#define IRQMUX_GPIOD_IF_PIN5_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN5_Pos)
#define IRQMUX_GPIOD_IF_PIN6_Pos	6
#define IRQMUX_GPIOD_IF_PIN6_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN6_Pos)
#define IRQMUX_GPIOD_IF_PIN7_Pos	7
#define IRQMUX_GPIOD_IF_PIN7_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN7_Pos)
#define IRQMUX_GPIOD_IF_PIN8_Pos	8
#define IRQMUX_GPIOD_IF_PIN8_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN8_Pos)
#define IRQMUX_GPIOD_IF_PIN9_Pos	9
#define IRQMUX_GPIOD_IF_PIN9_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN9_Pos)
#define IRQMUX_GPIOD_IF_PIN10_Pos	10
#define IRQMUX_GPIOD_IF_PIN10_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN10_Pos)
#define IRQMUX_GPIOD_IF_PIN11_Pos	11
#define IRQMUX_GPIOD_IF_PIN11_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN11_Pos)
#define IRQMUX_GPIOD_IF_PIN12_Pos	12
#define IRQMUX_GPIOD_IF_PIN12_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN12_Pos)
#define IRQMUX_GPIOD_IF_PIN13_Pos	13
#define IRQMUX_GPIOD_IF_PIN13_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN13_Pos)
#define IRQMUX_GPIOD_IF_PIN14_Pos	14
#define IRQMUX_GPIOD_IF_PIN14_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN14_Pos)
#define IRQMUX_GPIOD_IF_PIN15_Pos	15
#define IRQMUX_GPIOD_IF_PIN15_Msk	(0x01 << IRQMUX_GPIOD_IF_PIN15_Pos)

#define IRQMUX_GPIOE_IF_PIN0_Pos	0
#define IRQMUX_GPIOE_IF_PIN0_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN0_Pos)
#define IRQMUX_GPIOE_IF_PIN1_Pos	1
#define IRQMUX_GPIOE_IF_PIN1_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN1_Pos)
#define IRQMUX_GPIOE_IF_PIN2_Pos	2
#define IRQMUX_GPIOE_IF_PIN2_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN2_Pos)
#define IRQMUX_GPIOE_IF_PIN3_Pos	3
#define IRQMUX_GPIOE_IF_PIN3_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN3_Pos)
#define IRQMUX_GPIOE_IF_PIN4_Pos	4
#define IRQMUX_GPIOE_IF_PIN4_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN4_Pos)
#define IRQMUX_GPIOE_IF_PIN5_Pos	5
#define IRQMUX_GPIOE_IF_PIN5_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN5_Pos)
#define IRQMUX_GPIOE_IF_PIN6_Pos	6
#define IRQMUX_GPIOE_IF_PIN6_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN6_Pos)
#define IRQMUX_GPIOE_IF_PIN7_Pos	7
#define IRQMUX_GPIOE_IF_PIN7_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN7_Pos)
#define IRQMUX_GPIOE_IF_PIN8_Pos	8
#define IRQMUX_GPIOE_IF_PIN8_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN8_Pos)
#define IRQMUX_GPIOE_IF_PIN9_Pos	9
#define IRQMUX_GPIOE_IF_PIN9_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN9_Pos)
#define IRQMUX_GPIOE_IF_PIN10_Pos	10
#define IRQMUX_GPIOE_IF_PIN10_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN10_Pos)
#define IRQMUX_GPIOE_IF_PIN11_Pos	11
#define IRQMUX_GPIOE_IF_PIN11_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN11_Pos)
#define IRQMUX_GPIOE_IF_PIN12_Pos	12
#define IRQMUX_GPIOE_IF_PIN12_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN12_Pos)
#define IRQMUX_GPIOE_IF_PIN13_Pos	13
#define IRQMUX_GPIOE_IF_PIN13_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN13_Pos)
#define IRQMUX_GPIOE_IF_PIN14_Pos	14
#define IRQMUX_GPIOE_IF_PIN14_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN14_Pos)
#define IRQMUX_GPIOE_IF_PIN15_Pos	15
#define IRQMUX_GPIOE_IF_PIN15_Msk	(0x01 << IRQMUX_GPIOE_IF_PIN15_Pos)




