KemGong/cola_os/bsp/SWM181xx/Libraries/SWM181_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM181.h
#define FLASH_IM_DONE_Pos			0
#define FLASH_IM_DONE_Msk			(0x01 << FLASH_IM_DONE_Pos)
#define FLASH_IM_FE_Pos				1
#define FLASH_IM_FE_Msk				(0x01 << FLASH_IM_FE_Pos)
#define FLASH_IM_FHF_Pos			2
#define FLASH_IM_FHF_Msk			(0x01 << FLASH_IM_FHF_Pos)
#define FLASH_IM_FF_Pos				3
#define FLASH_IM_FF_Msk				(0x01 << FLASH_IM_FF_Pos)
#define FLASH_IM_OVF_Pos			4
#define FLASH_IM_OVF_Msk			(0x01 << FLASH_IM_OVF_Pos)
#define FLASH_IM_UVF_Pos			5
#define FLASH_IM_UVF_Msk			(0x01 << FLASH_IM_UVF_Pos)
#define FLASH_IM_WRERR_Pos			6
#define FLASH_IM_WRERR_Msk			(0x01 << FLASH_IM_WRERR_Pos)

#define FLASH_CR2_CCEE_Pos			0		//CMD Code Edit Enable，1 可以写下面5个CMDCODE寄存器
#define FLASH_CR2_CCEE_Msk			(0x01 << FLASH_CR2_CCEE_Pos)
#define FLASH_CR2_WIPBIT_Pos		1		//WIP时STATUS REG的哪一位，0 STATUS_REG[0]    1 STATUS_REG[1]  ... ...  15 STATUS_REG[15]
#define FLASH_CR2_WIPBIT_Msk		(0x0F << FLASH_CR2_WIPBIT_Pos)
#define FLASH_CR2_CLKDIV_Pos		5		//模块SCLK频率 = ：0 SYS_CLK    1 SYS_CLK/2    2 SYS_CLK/4    3 SYS_CLK/8
#define FLASH_CR2_CLKDIV_Msk		(0x03 << FLASH_CR2_CLKDIV_Pos)
#define FLASH_CR2_SYSMHZ_Pos		7		//系统时钟时多少MHz，如当系统主频位32MHz时，此处填32
#define FLASH_CR2_SYSMHZ_Msk		(0x3F << FLASH_CR2_SYSMHZ_Pos)
#define FLASH_CR2_RDMODE_Pos		13		//0 单线模式读取    1 2线模式读取    2 4线模式读取
#define FLASH_CR2_RDMODE_Msk		(0x03 << FLASH_CR2_RDMODE_Pos)

#define FLASH_CMDCODE1_WREN_Pos		0		//写使能
#define FLASH_CMDCODE1_WREN_Msk		(0xFF << FLASH_CMDCODE1_WREN_Pos)
#define FLASH_CMDCODE1_WRDIS_Pos	8		//写禁止
#define FLASH_CMDCODE1_WRDIS_Msk	(0xFF << FLASH_CMDCODE1_WRDIS_Pos)
#define FLASH_CMDCODE1_SRWREN_Pos	16		//STATUS REG 写使能
#define FLASH_CMDCODE1_SRWREN_Msk	(0xFF << FLASH_CMDCODE1_SRWREN_Pos)
#define FLASH_CMDCODE1_WRSR_Pos		24		//Write STATUS REG
#define FLASH_CMDCODE1_WRSR_Msk		(0xFF << FLASH_CMDCODE1_WRSR_Pos)

#define FLASH_CMDCODE2_RDID_Pos		0		//Read ID
#define FLASH_CMDCODE2_RDID_Msk		(0xFF << FLASH_CMDCODE2_RDID_Pos)
#define FLASH_CMDCODE2_RDMID_Pos	8		//Read MID
#define FLASH_CMDCODE2_RDMID_Msk	(0xFF << FLASH_CMDCODE2_RDMID_Pos)
#define FLASH_CMDCODE2_RDSRL_Pos	16		//Read STATUS REG 低8位
#define FLASH_CMDCODE2_RDSRL_Msk	(0xFF << FLASH_CMDCODE2_RDSRL_Pos)
#define FLASH_CMDCODE2_RDSRH_Pos	24		//Read STATUS REG 高8位
#define FLASH_CMDCODE2_RDSRH_Msk	(0xFF << FLASH_CMDCODE2_RDSRH_Pos)

#define FLASH_CMDCODE3_RD1_Pos		0		//1线读取
#define FLASH_CMDCODE3_RD1_Msk		(0xFF << FLASH_CMDCODE3_RD1_Pos)
#define FLASH_CMDCODE3_RD2_Pos		8		//2线读取
#define FLASH_CMDCODE3_RD2_Msk		(0xFF << FLASH_CMDCODE3_RD2_Pos)
#define FLASH_CMDCODE3_RD4_Pos		16		//4线读取
#define FLASH_CMDCODE3_RD4_Msk		(0xFF << FLASH_CMDCODE3_RD4_Pos)
#define FLASH_CMDCODE3_PPG_Pos		24		//Page Program，页编程
#define FLASH_CMDCODE3_PPG_Msk		(0xFF << FLASH_CMDCODE3_PPG_Pos)

#define FLASH_CMDCODE4_SECERAS_Pos	0		//Sector Erase
#define FLASH_CMDCODE4_SECERAS_Msk	(0xFF << FLASH_CMDCODE4_SECERAS_Pos)
#define FLASH_CMDCODE4_BE32K_Pos	8		//32K Bank Erase
#define FLASH_CMDCODE4_BE32K_Msk	(0xFF << FLASH_CMDCODE4_BE32K_Pos)
#define FLASH_CMDCODE4_BE64K_Pos	16		//64K Bank Erase
#define FLASH_CMDCODE4_BE64K_Msk	(0xFF << FLASH_CMDCODE4_BE64K_Pos)
#define FLASH_CMDCODE4_CHPERAS_Pos	24		//Chip Erase
#define FLASH_CMDCODE4_CHPERAS_Msk	(0xFF << FLASH_CMDCODE4_CHPERAS_Pos)

#define FLASH_CMDCODE5_SLEEP_Pos	0		//睡眠模式
#define FLASH_CMDCODE5_SLEEP_Msk	(0xFF << FLASH_CMDCODE5_SLEEP_Pos)
#define FLASH_CMDCODE5_WKUP_Pos		8		//睡眠唤醒
#define FLASH_CMDCODE5_WKUP_Msk		(0xFF << FLASH_CMDCODE5_WKUP_Pos)
#define FLASH_CMDCODE5_PRGSUS_Pos	16		//Program/Erase Suspend
#define FLASH_CMDCODE5_PRGSUS_Msk	(0xFF << FLASH_CMDCODE5_PRGSUS_Pos)
#define FLASH_CMDCODE5_PRGRSUM_Pos	24		//Program/Erase Resum
#define FLASH_CMDCODE5_PRGRSUM_Msk	(0xFF << FLASH_CMDCODE5_PRGRSUM_Pos)




typedef struct {
	__IO uint32_t PORTA_SEL1;				//给PORTA_SEL1[2n+2:2n]赋下面相应的值，将PORTA.PINn引脚配置成GPIO、模拟、数字等功能
											//当赋值为PORTA_PINn_FUNMUX时，PORTA.PINn引脚可通过PORTA->FUNMUX寄存器连接到各种数字外设
	
	__IO uint32_t PORTA_SEL2;
	
		 uint32_t RESERVED[2];
	
	__IO uint32_t PORTB_SEL;
	
		 uint32_t RESERVED2[3];
	
	__IO uint32_t PORTC_SEL;
	
		 uint32_t RESERVED3[3];
	
	__IO uint32_t PORTD_SEL;
	
		 uint32_t RESERVED4[3];
	
	__IO uint32_t PORTE_SEL;
} PORTG_TypeDef;


#define PORTG_PORTA_SEL1_PIN0_Pos	0
#define PORTG_PORTA_SEL1_PIN0_Msk	(0x03 << PORTG_PORTA_SEL1_PIN0_Pos)
#define PORTG_PORTA_SEL1_PIN1_Pos	2
#define PORTG_PORTA_SEL1_PIN1_Msk	(0x03 << PORTG_PORTA_SEL1_PIN1_Pos)
#define PORTG_PORTA_SEL1_PIN2_Pos	4
#define PORTG_PORTA_SEL1_PIN2_Msk	(0x03 << PORTG_PORTA_SEL1_PIN2_Pos)
#define PORTG_PORTA_SEL1_PIN3_Pos	6
#define PORTG_PORTA_SEL1_PIN3_Msk	(0x03 << PORTG_PORTA_SEL1_PIN3_Pos)
#define PORTG_PORTA_SEL1_PIN4_Pos	8
#define PORTG_PORTA_SEL1_PIN4_Msk	(0x03 << PORTG_PORTA_SEL1_PIN4_Pos)
#define PORTG_PORTA_SEL1_PIN5_Pos	10
#define PORTG_PORTA_SEL1_PIN5_Msk	(0x03 << PORTG_PORTA_SEL1_PIN5_Pos)
#define PORTG_PORTA_SEL1_PIN6_Pos	12
#define PORTG_PORTA_SEL1_PIN6_Msk	(0x03 << PORTG_PORTA_SEL1_PIN6_Pos)
#define PORTG_PORTA_SEL1_PIN7_Pos	14
#define PORTG_PORTA_SEL1_PIN7_Msk	(0x03 << PORTG_PORTA_SEL1_PIN7_Pos)

#define PORTG_PORTA_SEL2_PIN8_Pos	0
#define PORTG_PORTA_SEL2_PIN8_Msk	(0x03 << PORTG_PORTA_SEL2_PIN8_Pos)
#define PORTG_PORTA_SEL2_PIN9_Pos	2
#define PORTG_PORTA_SEL2_PIN9_Msk	(0x03 << PORTG_PORTA_SEL2_PIN9_Pos)
#define PORTG_PORTA_SEL2_PIN10_Pos	4
#define PORTG_PORTA_SEL2_PIN10_Msk	(0x03 << PORTG_PORTA_SEL2_PIN10_Pos)
#define PORTG_PORTA_SEL2_PIN11_Pos	6
#define PORTG_PORTA_SEL2_PIN11_Msk	(0x03 << PORTG_PORTA_SEL2_PIN11_Pos)
#define PORTG_PORTA_SEL2_PIN12_Pos	8
#define PORTG_PORTA_SEL2_PIN12_Msk	(0x07 << PORTG_PORTA_SEL2_PIN12_Pos)
#define PORTG_PORTA_SEL2_PIN13_Pos	11
#define PORTG_PORTA_SEL2_PIN13_Msk	(0x07 << PORTG_PORTA_SEL2_PIN13_Pos)
#define PORTG_PORTA_SEL2_PIN14_Pos	14
#define PORTG_PORTA_SEL2_PIN14_Msk	(0x07 << PORTG_PORTA_SEL2_PIN14_Pos)
#define PORTG_PORTA_SEL2_PIN15_Pos	17
#define PORTG_PORTA_SEL2_PIN15_Msk	(0x07 << PORTG_PORTA_SEL2_PIN15_Pos)

#define PORTG_PORTB_SEL_PIN0_Pos	0
#define PORTG_PORTB_SEL_PIN0_Msk	(0x03 << PORTG_PORTB_SEL_PIN0_Pos)
#define PORTG_PORTB_SEL_PIN1_Pos	2
#define PORTG_PORTB_SEL_PIN1_Msk	(0x03 << PORTG_PORTB_SEL_PIN1_Pos)
#define PORTG_PORTB_SEL_PIN2_Pos	4
#define PORTG_PORTB_SEL_PIN2_Msk	(0x03 << PORTG_PORTB_SEL_PIN2_Pos)
#define PORTG_PORTB_SEL_PIN3_Pos	6
#define PORTG_PORTB_SEL_PIN3_Msk	(0x03 << PORTG_PORTB_SEL_PIN3_Pos)
#define PORTG_PORTB_SEL_PIN4_Pos	8
#define PORTG_PORTB_SEL_PIN4_Msk	(0x03 << PORTG_PORTB_SEL_PIN4_Pos)
#define PORTG_PORTB_SEL_PIN5_Pos	10
#define PORTG_PORTB_SEL_PIN5_Msk	(0x03 << PORTG_PORTB_SEL_PIN5_Pos)
#define PORTG_PORTB_SEL_PIN6_Pos	12
#define PORTG_PORTB_SEL_PIN6_Msk	(0x03 << PORTG_PORTB_SEL_PIN6_Pos)
#define PORTG_PORTB_SEL_PIN7_Pos	14
#define PORTG_PORTB_SEL_PIN7_Msk	(0x03 << PORTG_PORTB_SEL_PIN7_Pos)
#define PORTG_PORTB_SEL_PIN8_Pos	16
#define PORTG_PORTB_SEL_PIN8_Msk	(0x03 << PORTG_PORTB_SEL_PIN8_Pos)
#define PORTG_PORTB_SEL_PIN9_Pos	18
#define PORTG_PORTB_SEL_PIN9_Msk	(0x03 << PORTG_PORTB_SEL_PIN9_Pos)
#define PORTG_PORTB_SEL_PIN10_Pos	20
#define PORTG_PORTB_SEL_PIN10_Msk	(0x03 << PORTG_PORTB_SEL_PIN10_Pos)
#define PORTG_PORTB_SEL_PIN11_Pos	22
#define PORTG_PORTB_SEL_PIN11_Msk	(0x03 << PORTG_PORTB_SEL_PIN11_Pos)
#define PORTG_PORTB_SEL_PIN12_Pos	24
#define PORTG_PORTB_SEL_PIN12_Msk	(0x03 << PORTG_PORTB_SEL_PIN12_Pos)
#define PORTG_PORTB_SEL_PIN13_Pos	26
#define PORTG_PORTB_SEL_PIN13_Msk	(0x03 << PORTG_PORTB_SEL_PIN13_Pos)
#define PORTG_PORTB_SEL_PIN14_Pos	28
#define PORTG_PORTB_SEL_PIN14_Msk	(0x03 << PORTG_PORTB_SEL_PIN14_Pos)
#define PORTG_PORTB_SEL_PIN15_Pos	30
#define PORTG_PORTB_SEL_PIN15_Msk	(0x03 << PORTG_PORTB_SEL_PIN15_Pos)

